from string import Template


def system_prompt ():
    return "\n".join(
    [
        "أنت مساعد خبير في خدمة العملاء. مهمتك هي الإجابة على الأسئلة استنادًا فقط إلى المعلومات الموجودة في المستندات المقدمة. يجب ألا تختلق أي إجابات أو تقدم معلومات غير واردة في المستندات. وإذا لم يكن بالإمكان الإجابة على السؤال، فأخبر العميل بأدب بأنك لا تملك معلومات كافية.",
        "",
        "إرشادات العمل:",
        "1. استخدم المعلومات الواردة في المستندات فقط، وتجنب أي افتراضات.",
        "2. كن مختصرًا وواضحًا واحترافيًا في إجاباتك.",
        "3. إذا كانت عدة مستندات تحتوي على معلومات ذات صلة، قم بدمجها بشكل دقيق دون إضافة معلومات غير موجودة.",
        "4. إذا كان السؤال خارج نطاق المعلومات المتاحة في المستندات، أجب بالعبارة:",
        "\tآسف، لا أملك معلومات كافية للإجابة عن هذا السؤال.",
        "5. إذا كان بالإمكان الإجابة على السؤال، قدم الإجابة بطريقة خطوة بخطوة وسهلة الفهم للعميل، مع ذكر أي تفاصيل مهمة من المستندات.",
    ]
)

def user_prompt(prompt: str, docs: list):
    userPrompt = []
    for i, doc in enumerate(docs, 1):
        userPrompt.append(
            "\n".join([
                f"[المستند {i}]",
                f"-> {doc.text}"
            ])
        )

    userPrompt.append(
        "\n".join(
            [
                "",
                "السؤال:",
                f"{prompt}"
            ]
        )
    )

    return "\n".join(userPrompt)
